uliano/brio/brio/stm32f4/device_tables.hpp
/*
 * device_tables.hpp
 *
 * THE RESERVE of the stm32f4 stratum - the one file where the
 * preprocessor is allowed to ask the device header what exists. The
 * standing rule (docs/design/overview.md, "Generalization rule"): a probe
 * that yields a VALUE lives here and is exported as constexpr data; a
 * driver keeps `#ifdef` only to select per-instance CODE, never to learn
 * a fact. Nothing here is a copied table - every entry is the device
 * header's own symbol, so a variant the pack adds tomorrow is described
 * by its header and not by a list someone has to keep - with ONE class
 * of exception, stated where it is made: the frequency ladders.
 *
 * WHAT DIFFERS ACROSS THE STM32F4 FAMILY, as far as the strata reach
 * (cmsis-device-f4 v2.6.9, all twenty-three headers of the pack, one
 * umbrella stm32f4xx.h dispatching on the device-select define):
 *  - GPIO ports: A, B, C and H on every part; D from the 64-pin
 *    bondings of the F412 up and on every F401/F411, E from the
 *    100-pin ones and again on every F401/F411; F and G on the F405
 *    class, the F412Zx, the F413/F423 and the F446; I on the F405 class
 *    and the big packages; J and K on the F42x/F43x and F469/F479 alone.
 *  - Serial instances: USART1 and USART2 everywhere, USART6 everywhere
 *    but the 36-pin F410Tx; USART3 on the F405 class and up and on the
 *    F412/F413; UART4 and UART5 on the F405 class, the F413/F423, the
 *    F42x/F43x, the F446 and the F469/F479; UART7 and UART8 on the
 *    F413/F423, the F42x/F43x and the F469/F479; UART9 and UART10 on the
 *    F413/F423 alone. USART1 and USART6 sit on APB2, every other
 *    instance on APB1 - which decides the bus rate a baud divisor
 *    divides.
 *  - Which instances are FULL. RM0090 table 148 (and its RM0390 and
 *    RM0383 twins): UART4, UART5, UART7 and UART8 have no synchronous
 *    mode, no smartcard and no hardware flow control. That is not in
 *    the header - the U(S)ART distinction in the NAME is what carries
 *    it, and usart_is_full() reads the name.
 *  - Interrupt lines: on this family a vector is mostly ONE
 *    peripheral's, and the sharing the table does show (TIM1_BRK_TIM9,
 *    TIM8_UP_TIM13, TIM6_DAC, the EXTI groups, the I2C's EV/ER pair) is
 *    the same on every header that has both parties. IRQn values are
 *    enumerators the preprocessor cannot probe, so every vector verb
 *    here is guarded by the instance's base-address macro and a header
 *    without the instance has no verb for it.
 *  - The regulator: two VOS bits on every part but the F405/F407/F415/
 *    F417, whose PWR_CR carries ONE (PWR_CR_VOS_1 is what the header
 *    declares or not); the over-drive pair ODEN/ODSWEN on the F42x/F43x,
 *    the F446 and the F469/F479 alone (PWR_CR_ODEN).
 *  - The flash interface's LATENCY field: four bits where the ladder
 *    reaches 180 MHz, three where it does not (FLASH_ACR_LATENCY_Msk).
 *  - The PLL's R output (PLLCFGR.PLLR, the F446's and F469's), and the
 *    second PLL's names (PLLI2S everywhere, PLLSAI where an LTDC or a
 *    SAI needs it) - none of them this stratum's business yet.
 *
 * THE FREQUENCY LADDERS ARE THE EXCEPTION. How fast a part may run at
 * each regulator scale, with and without over-drive, how many flash
 * wait states a HCLK needs and how fast each APB may go are facts of
 * the REFERENCE MANUAL, not of the header, and they differ per part
 * class. They are keyed here on the device-select macro - the one
 * thing about the part the preprocessor can know - and stated ONLY for
 * the classes whose manual was read for them (RM0090 for the F405/F407
 * and F42x/F43x classes, RM0390 for the F446, RM0383 for the F411,
 * RM0386 for the F469/F479). A
 * header outside those classes gets `sysclk_ladder().known == false`,
 * and stm32f4/clock.hpp refuses any rate above the reset one there
 * rather than run a part on a ladder nobody read. The voltage range
 * every ladder is stated for is 2.7..3.6 V, the boards' supply; the
 * lower ranges' columns are declared and not carried.
 */

#pragma once

#include <stddef.h>
#include <stdint.h>

#include "stm32f4xx.h"

namespace brio {

// ---- GPIO ports -------------------------------------------------------------

/// Register block base of GPIO port `letter` (A..K), 0 when the device
/// header does not declare it. The header's GPIOx_BASE is the authority.
constexpr uint32_t gpio_port_base(char letter) {
    switch (letter) {
#if defined(GPIOA_BASE)
        case 'A': return GPIOA_BASE;
#endif
#if defined(GPIOB_BASE)
        case 'B': return GPIOB_BASE;
#endif
#if defined(GPIOC_BASE)
        case 'C': return GPIOC_BASE;
#endif
#if defined(GPIOD_BASE)
        case 'D': return GPIOD_BASE;
#endif
#if defined(GPIOE_BASE)
        case 'E': return GPIOE_BASE;
#endif
#if defined(GPIOF_BASE)
        case 'F': return GPIOF_BASE;
#endif
#if defined(GPIOG_BASE)
        case 'G': return GPIOG_BASE;
#endif
#if defined(GPIOH_BASE)
        case 'H': return GPIOH_BASE;
#endif
#if defined(GPIOI_BASE)
        case 'I': return GPIOI_BASE;
#endif
#if defined(GPIOJ_BASE)
        case 'J': return GPIOJ_BASE;
#endif
#if defined(GPIOK_BASE)
        case 'K': return GPIOK_BASE;
#endif
        default: return 0;
    }
}

/// Whether this device bonds GPIO port `letter` at all.
constexpr bool gpio_port_present(char letter) { return gpio_port_base(letter) != 0u; }

/// The RCC_AHB1ENR bit that clocks port `letter`; 0 when absent. The
/// header spells one macro per port, so each is probed by name.
constexpr uint32_t gpio_port_clock_mask(char letter) {
    switch (letter) {
#if defined(RCC_AHB1ENR_GPIOAEN)
        case 'A': return RCC_AHB1ENR_GPIOAEN;
#endif
#if defined(RCC_AHB1ENR_GPIOBEN)
        case 'B': return RCC_AHB1ENR_GPIOBEN;
#endif
#if defined(RCC_AHB1ENR_GPIOCEN)
        case 'C': return RCC_AHB1ENR_GPIOCEN;
#endif
#if defined(RCC_AHB1ENR_GPIODEN)
        case 'D': return RCC_AHB1ENR_GPIODEN;
#endif
#if defined(RCC_AHB1ENR_GPIOEEN)
        case 'E': return RCC_AHB1ENR_GPIOEEN;
#endif
#if defined(RCC_AHB1ENR_GPIOFEN)
        case 'F': return RCC_AHB1ENR_GPIOFEN;
#endif
#if defined(RCC_AHB1ENR_GPIOGEN)
        case 'G': return RCC_AHB1ENR_GPIOGEN;
#endif
#if defined(RCC_AHB1ENR_GPIOHEN)
        case 'H': return RCC_AHB1ENR_GPIOHEN;
#endif
#if defined(RCC_AHB1ENR_GPIOIEN)
        case 'I': return RCC_AHB1ENR_GPIOIEN;
#endif
#if defined(RCC_AHB1ENR_GPIOJEN)
        case 'J': return RCC_AHB1ENR_GPIOJEN;
#endif
#if defined(RCC_AHB1ENR_GPIOKEN)
        case 'K': return RCC_AHB1ENR_GPIOKEN;
#endif
        default: return 0;
    }
}

// ---- serial instances ---------------------------------------------------------

