uliano/brio/brio/stm32f4/device_tables.hpp
/// Whether (controller, stream, channel) is one of the cells instance `n`
/// can be served on. False on a part whose table was not read, and false
/// for an instance the read table has no row for - both refusals, never a
/// guess.
constexpr bool usart_dma_placement_valid(uint8_t n, bool transmit, uint8_t controller,
                                         uint8_t stream, uint8_t channel) {
    const DmaPlacements p = usart_dma_placements(n, transmit);
    if (!p.known) {
        return false;
    }
    for (uint8_t i = 0; i < p.count; ++i) {
        if (p.at[i].controller == controller && p.at[i].stream == stream &&
            p.at[i].channel == channel) {
            return true;
        }
    }
    return false;
}

// ---- timers -------------------------------------------------------------------
//
// WHAT THE HEADER CAN ANSWER AND WHAT IT CANNOT, and this chapter is where
// the two halves are furthest apart:
//  - WHICH TIMERS EXIST is the header's, three ways over: TIMn_BASE, the
//    RCC enable/reset masks and the IRQn enumerators. The F42x/F43x, F446,
//    F405 class, F412, F413/F423 and F469/F479 carry TIM1..TIM14; the
//    F401 and F411 have TIM1..TIM5 and TIM9..TIM11 and no other; the F410
//    has TIM1, TIM5, TIM6, TIM9 and TIM11 alone. Every one of those
//    statements is a probe below and not a list.
//  - WHAT A TIMER IS - counter width, how many channels, complementary
//    outputs, a slave controller, a repetition counter, an external
//    trigger, DMA - IS NOT IN THE DEVICE HEADER AT ALL. There is ONE
//    TIM_TypeDef and every register is a member of it on every instance,
//    so `TIM11->SMCR` compiles and writes a hole in the address map. Those
//    facts are the REFERENCE MANUALS' (RM0090 ch. 17..20, RM0390 ch. 15..18,
//    RM0383 ch. 12..14, each chapter's ".2 main features" and register
//    map), they are the same on every part of the family, and they are
//    spelled out below keyed by instance NUMBER and gated by the header's
//    own presence probe. Every verb of stm32f4/tim.hpp that names a
//    register an instance does not implement refuses instead of storing.
//  - THE PAD MAP IS THE DATASHEET'S (DS10314 table 9, DS10693 table 11,
//    the F429's table 12) and is not here at all, for the reason
//    stm32f4/pin.hpp gives once for the whole stratum: no symbol of the
//    device header carries it. A timer pad is a `PinSel` the caller
//    writes and the bench is the only check there is.

/// Register block base of TIMn (n = 1..14), 0 when the device has not got
/// it. TIM1, TIM5, TIM9 and TIM11 are on every part of the pack.
constexpr uint32_t tim_base(uint8_t n) {
    switch (n) {
#if defined(TIM1_BASE)
        case 1: return TIM1_BASE;
#endif
#if defined(TIM2_BASE)
        case 2: return TIM2_BASE;
#endif
#if defined(TIM3_BASE)
        case 3: return TIM3_BASE;
#endif
#if defined(TIM4_BASE)
        case 4: return TIM4_BASE;
#endif
#if defined(TIM5_BASE)
        case 5: return TIM5_BASE;
#endif
#if defined(TIM6_BASE)
        case 6: return TIM6_BASE;
#endif
#if defined(TIM7_BASE)
        case 7: return TIM7_BASE;
#endif
#if defined(TIM8_BASE)
        case 8: return TIM8_BASE;
#endif
#if defined(TIM9_BASE)
        case 9: return TIM9_BASE;
#endif
#if defined(TIM10_BASE)
        case 10: return TIM10_BASE;
#endif
#if defined(TIM11_BASE)
        case 11: return TIM11_BASE;
#endif
#if defined(TIM12_BASE)
        case 12: return TIM12_BASE;
#endif
#if defined(TIM13_BASE)
        case 13: return TIM13_BASE;
#endif
#if defined(TIM14_BASE)
        case 14: return TIM14_BASE;
#endif
        default: return 0;
    }
}

constexpr bool tim_present(uint8_t n) { return tim_base(n) != 0u; }

/// Which APB carries TIMn, and its enable/reset bit in that bus's ENR and
/// RSTR. TIM1, TIM8 and TIM9..TIM11 are the APB2 instances of this family;
/// TIM2..TIM7 and TIM12..TIM14 sit on APB1 (RM0090 table 1). `enable_mask`
/// 0 means "no such instance".
struct TimBusClock {
    bool apb2 = false;
    uint32_t enable_mask = 0;
    uint32_t reset_mask = 0;
};

constexpr TimBusClock tim_bus_clock(uint8_t n) {
    switch (n) {
#if defined(RCC_APB2ENR_TIM1EN)
        case 1: return {true, RCC_APB2ENR_TIM1EN, RCC_APB2RSTR_TIM1RST};
#endif
#if defined(RCC_APB1ENR_TIM2EN)
        case 2: return {false, RCC_APB1ENR_TIM2EN, RCC_APB1RSTR_TIM2RST};
#endif
#if defined(RCC_APB1ENR_TIM3EN)
        case 3: return {false, RCC_APB1ENR_TIM3EN, RCC_APB1RSTR_TIM3RST};
#endif
#if defined(RCC_APB1ENR_TIM4EN)
        case 4: return {false, RCC_APB1ENR_TIM4EN, RCC_APB1RSTR_TIM4RST};
#endif
#if defined(RCC_APB1ENR_TIM5EN)
        case 5: return {false, RCC_APB1ENR_TIM5EN, RCC_APB1RSTR_TIM5RST};
#endif
#if defined(RCC_APB1ENR_TIM6EN)
        case 6: return {false, RCC_APB1ENR_TIM6EN, RCC_APB1RSTR_TIM6RST};
#endif
#if defined(RCC_APB1ENR_TIM7EN)
        case 7: return {false, RCC_APB1ENR_TIM7EN, RCC_APB1RSTR_TIM7RST};
#endif
#if defined(RCC_APB2ENR_TIM8EN)
        case 8: return {true, RCC_APB2ENR_TIM8EN, RCC_APB2RSTR_TIM8RST};
#endif
#if defined(RCC_APB2ENR_TIM9EN)
        case 9: return {true, RCC_APB2ENR_TIM9EN, RCC_APB2RSTR_TIM9RST};
#endif
#if defined(RCC_APB2ENR_TIM10EN)
        case 10: return {true, RCC_APB2ENR_TIM10EN, RCC_APB2RSTR_TIM10RST};
#endif
#if defined(RCC_APB2ENR_TIM11EN)
        case 11: return {true, RCC_APB2ENR_TIM11EN, RCC_APB2RSTR_TIM11RST};
#endif
#if defined(RCC_APB1ENR_TIM12EN)
        case 12: return {false, RCC_APB1ENR_TIM12EN, RCC_APB1RSTR_TIM12RST};
#endif
#if defined(RCC_APB1ENR_TIM13EN)
        case 13: return {false, RCC_APB1ENR_TIM13EN, RCC_APB1RSTR_TIM13RST};
#endif
#if defined(RCC_APB1ENR_TIM14EN)
        case 14: return {false, RCC_APB1ENR_TIM14EN, RCC_APB1RSTR_TIM14RST};
#endif
        default: return {};
    }
}

/// Counter width in BITS: TIM2 and TIM5 are the family's two 32-bit
/// counters, every other timer is 16-bit (RM0090 18.1). 0 for an instance
/// this device has not got.
constexpr uint8_t tim_counter_bits(uint8_t n) {
    if (!tim_present(n)) {
        return 0;
    }
    return (n == 2u || n == 5u) ? 32u : 16u;
}

