uliano/brio/brio/stm32f4/device_tables.hpp
constexpr IRQn_Type i2c_error_irq(uint8_t n) {
    switch (n) {
#if defined(I2C1_BASE)
        case 1: return I2C1_ER_IRQn;
#endif
#if defined(I2C2_BASE)
        case 2: return I2C2_ER_IRQn;
#endif
#if defined(I2C3_BASE)
        case 3: return I2C3_ER_IRQn;
#endif
        default: return NonMaskableInt_IRQn;
    }
}

/// Whether I2C_FLTR's two fields exist on this part - the analog filter's
/// off switch and the digital filter's length.
constexpr bool i2c_has_filter() {
#if defined(I2C_FLTR_ANOFF)
    return true;
#else
    return false;
#endif
}

/**
 * The I2C slice of the DMA request mapping (RM0090 table 43, RM0390 table
 * 28, RM0383 table 27) - every cell is on DMA1, this block having no
 * request on the other controller. Keyed per part class like every other
 * chapter's slice, and the three classes DISAGREE:
 *  - the F405 class, the F42x/F43x and the F469/F479 (RM0386 table 29)
 *    have one cell for I2C3_RX;
 *  - the F446 adds a second (DMA1 stream 1, channel 1);
 *  - the F411 has that one too, AND a third cell for I2C1_TX (stream 1,
 *    channel 0) and a second for I2C3_TX (stream 5, channel 6).
 */
constexpr DmaPlacements i2c_dma_placements(uint8_t n, bool transmit) {
    DmaPlacements p{};
#if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || \
    defined(STM32F417xx) || defined(STM32F427xx) || defined(STM32F437xx) || \
    defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F446xx) || \
    defined(STM32F411xE) || defined(STM32F469xx) || defined(STM32F479xx)
    p.known = true;
    if (!i2c_present(n)) {
        return p;   // the class's table is read, this part has no such instance
    }
    switch (n) {
        case 1:
            if (transmit) {
                p.count = 2;
                p.at[0] = {1, 6, 1};
                p.at[1] = {1, 7, 1};
#if defined(STM32F411xE)
                // RM0383 table 27, channel 0 stream 1 - the F411's alone.
                p.count = 3;
                p.at[2] = {1, 1, 0};
#endif
            } else {
                p.count = 2;
                p.at[0] = {1, 0, 1};
                p.at[1] = {1, 5, 1};
            }
            break;
        case 2:
            if (transmit) {
                p.count = 1;
                p.at[0] = {1, 7, 7};
            } else {
                p.count = 2;
                p.at[0] = {1, 2, 7};
                p.at[1] = {1, 3, 7};
            }
            break;
        case 3:
            if (transmit) {
                p.count = 1;
                p.at[0] = {1, 4, 3};
#if defined(STM32F411xE)
                // RM0383 table 27, channel 6 stream 5.
                p.count = 2;
                p.at[1] = {1, 5, 6};
#endif
            } else {
                p.count = 1;
                p.at[0] = {1, 2, 3};
#if defined(STM32F446xx) || defined(STM32F411xE)
                // RM0390 table 28 and RM0383 table 27, channel 1 stream 1.
                p.count = 2;
                p.at[1] = {1, 1, 1};
#endif
            }
            break;
        default: break;
    }
#else
    (void)n;
    (void)transmit;
#endif
    return p;
}

/// Whether (controller, stream, channel) is a cell instance `n`'s request
/// is wired to. False on a part whose table was not read, and false for an
/// instance the read table has no row for - both refusals, never a guess.
constexpr bool i2c_dma_placement_valid(uint8_t n, bool transmit, uint8_t controller,
                                       uint8_t stream, uint8_t channel) {
    const DmaPlacements p = i2c_dma_placements(n, transmit);
    if (!p.known) {
        return false;
    }
    for (uint8_t i = 0; i < p.count; ++i) {
        if (p.at[i].controller == controller && p.at[i].stream == stream &&
            p.at[i].channel == channel) {
            return true;
        }
    }
    return false;
}

/**
 * FMPI2C1 - THE FACTS THE I2C CHAPTER PUBLISHES. The Fast-mode Plus I2C
 * some parts of this family carry (the F410, F412, F413/F423 and F446) is
 * NOT this chapter's block wearing another name: it is the register file
 * of the STM32G0's I2C - one TIMINGR word, ISR/ICR, a byte counter,
 * autoend - so it is another chapter, stm32f4/fmpi2c.hpp, whose own
 * section sits at the end of this file; stm32f4/i2c.hpp does not touch
 * it. What is published here is what the header knows.
 */
constexpr uint32_t fmpi2c_base() {
#if defined(FMPI2C1_BASE)
    return FMPI2C1_BASE;
#else
    return 0u;
#endif
}

constexpr bool fmpi2c_present() { return fmpi2c_base() != 0u; }

constexpr uint32_t fmpi2c_clock_mask() {
#if defined(RCC_APB1ENR_FMPI2C1EN)
    return RCC_APB1ENR_FMPI2C1EN;
#else
    return 0u;
#endif
}

constexpr IRQn_Type fmpi2c_event_irq() {
#if defined(FMPI2C1_BASE)
    return FMPI2C1_EV_IRQn;
#else
    return NonMaskableInt_IRQn;
#endif
}

constexpr IRQn_Type fmpi2c_error_irq() {
#if defined(FMPI2C1_BASE)
    return FMPI2C1_ER_IRQn;
#else
    return NonMaskableInt_IRQn;
#endif
}

// ---- the embedded flash memory interface --------------------------------------
//
// THE HEADER IS NOT THE AUTHORITY IN THIS CHAPTER, and it is the clearest
// case of it in the whole stratum: ST declares one FLASH_TypeDef and one
// set of bit masks for a whole marketing line, so the F446's header carries
// `FLASH_CR_MER2`, `FLASH_OPTCR_DB1M` and `FLASH_OPTCR_BFB2` - three bits of
// a SECOND BANK that part has not got (RM0390 3.3: 512 Kbytes, one bank,
// eight sectors, and a FLASH_CR whose SNB is four bits) - while the F411's
// header does NOT carry `FLASH_OPTCR_SPRMOD`, a bit RM0383 3.6.5 describes
// in full. Both directions of error in one chapter.
//
// So what a part's flash interface IS comes from the REFERENCE MANUAL and is
// keyed on the device-select define, as the frequency ladders and the RTC's
// pads are, and it is stated only for the classes whose chapter 3 was read:
// RM0090 3.3 (the F405/F407/F415/F417 class), RM0090 3.4 (the F42x/F43x
// class), RM0390 3.3 (the F446), RM0383 3.3 (the F411). A header outside
// those gets `known == false`: stm32f4/flash.hpp then has no sector map to
// name, so it refuses every erase there rather than aim SNB at a guess -
// while PROGRAMMING, which needs no map at all, keeps working everywhere.
//
// ONE FACT IS THE SAME IN ALL FOUR CHAPTERS and is therefore a rule and not
// a table: a bank's sectors are FOUR of 16 Kbytes, then ONE of 64, then 128
// Kbytes to the end of the bank (RM0090 tables 5, 6, 8, 9 and 10, RM0390
// table 4, RM0383 table 4). How many there are is the flash size register's
// business at run time, which is why the map is computed in flash.hpp and
// only its SHAPE is here.

/// What one part class's flash interface is - the reference manual's
/// answers to the questions the device header answers wrongly or not at
/// all. `known` false means the chapter was not read for this part.
struct FlashFacts {
    bool known = false;
    /// Sectors in ONE bank at most - twelve where a bank may reach 1 Mbyte
    /// (the F405 and F42x/F43x classes), eight on the 512 Kbyte parts.
    uint8_t max_sectors_per_bank = 0;
    /// FLASH_CR.SNB's width: five bits only where the sector numbering has
    /// to carry a bank (RM0090 3.9.8), four everywhere else.
    uint8_t snb_bits = 4;
    /// A second bank exists, or an option bit can make one (RM0090 3.4).
    bool dual_bank_capable = false;
    /// OPTCR.DB1M - a 1 Mbyte part split into two 512 Kbyte banks.
    bool has_dual_bank_option = false;
    /// OPTCR.BFB2 - the boot from bank 2.
    bool has_dual_bank_boot = false;
    /// OPTCR.SPRMOD - nWRPi selecting PCROP instead of write protection.
    bool has_pcrop_mode = false;
    /// FLASH_SR.RDERR - the flag a D-bus read of a PCROPed sector raises.
    bool has_read_error = false;
    /// How many nWRP bits one OPTCR carries: one per sector of its bank.
    uint8_t wrp_bits = 0;
    /// FLASH_OPTCR1 - bank 2's write protection, the dual-bank parts' alone.
    bool has_option_register1 = false;
};

