uliano/brio/brio/stm32f4/device_tables.hpp
constexpr FlashFacts flash_facts() {
    FlashFacts f{};
#if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || defined(STM32F417xx)
    // RM0090 3.3 and 3.9.7/3.9.9: up to 1 Mbyte in one bank of twelve
    // sectors, SNB four bits, nWRP twelve bits, no PCROP, no RDERR, no
    // second bank of any kind.
    f.known = true;
    f.max_sectors_per_bank = 12;
    f.wrp_bits = 12;
#elif defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx) || \
    defined(STM32F469xx) || defined(STM32F479xx)
    // RM0090 3.4, 3.9.8, 3.9.10 and 3.9.11 - and RM0386 3.3.1 (table 4),
    // 3.7.5, 3.7.6 and 3.7.7, the same organization on the F469/F479: two
    // banks of twelve sectors, SNB five bits (sectors 12..23 encoded
    // 16..27), nWRP twelve bits in each of OPTCR and OPTCR1, PCROP, RDERR,
    // DB1M and BFB2.
    f.known = true;
    f.max_sectors_per_bank = 12;
    f.snb_bits = 5;
    f.dual_bank_capable = true;
    f.has_dual_bank_option = true;
    f.has_dual_bank_boot = true;
    f.has_pcrop_mode = true;
    f.has_read_error = true;
    f.wrp_bits = 12;
    f.has_option_register1 = true;
#elif defined(STM32F446xx)
    // RM0390 3.3 and 3.7.5/3.7.6: 512 Kbytes in ONE bank of eight sectors,
    // SNB four bits, nWRP eight bits, PCROP and RDERR - and no MER2, no
    // DB1M and no BFB2 whatever the device header declares.
    f.known = true;
    f.max_sectors_per_bank = 8;
    f.has_pcrop_mode = true;
    f.has_read_error = true;
    f.wrp_bits = 8;
#elif defined(STM32F411xE)
    // RM0383 3.3, 3.8.5 and 3.8.6: 512 Kbytes in one bank of eight
    // sectors, SNB four bits, nWRP eight bits, PCROP (3.6.5) and RDERR
    // (3.8.4 bit 8) - the PCROP bit the header does not declare.
    f.known = true;
    f.max_sectors_per_bank = 8;
    f.has_pcrop_mode = true;
    f.has_read_error = true;
    f.wrp_bits = 8;
#endif
    return f;
}

/// The sector shape every chapter read states, in bytes: four of the
/// first size, one of the second, the rest of the third, per bank.
inline constexpr uint32_t flash_small_sector_bytes = 16u * 1024u;
inline constexpr uint8_t flash_small_sectors = 4;
inline constexpr uint32_t flash_middle_sector_bytes = 64u * 1024u;
inline constexpr uint32_t flash_large_sector_bytes = 128u * 1024u;

/// The first sector NUMBER of bank 2 (RM0090 tables 6 and 7: bank 1 ends
/// at eleven whatever its size, and bank 2 starts at twelve).
inline constexpr uint8_t flash_bank2_first_sector = 12;

/// FLASH_CR.SNB for sector `n`: its own number in bank 1, and four more
/// than its number in bank 2 - RM0090 3.9.8 leaves 12..15 "not allowed"
/// and starts bank 2 at 0b10000.
constexpr uint8_t flash_sector_number_code(uint8_t n) {
    return n >= flash_bank2_first_sector ? static_cast<uint8_t>(n + 4u) : n;
}

/// FLASH_SR.RDERR where the part has it, 0 where it has none - the one
/// flag of this chapter the device header gets right on every part of the
/// pack (test/family_stm32f4/flash.cpp asserts the two agree wherever the
/// manual was read).
constexpr uint32_t flash_read_error_flag() {
#if defined(FLASH_SR_RDERR)
    return FLASH_SR_RDERR;
#else
    return 0u;
#endif
}

/// FLASH_CR's bank-2 mass erase where the manual has one, 0 elsewhere.
/// THE NAME IS THE HEADER'S: RM0090 3.9.8 calls the bit MER1 and the pack
/// spells it `FLASH_CR_MER2`, same bit 15 - and it declares it on the F446
/// too, which has no bank 2, so `flash_facts()` and not the macro decides
/// whether this mask may ever be stored.
constexpr uint32_t flash_bank2_mass_erase_mask() {
#if defined(FLASH_CR_MER2)
    return FLASH_CR_MER2;
#else
    return 0u;
#endif
}

/// OPTCR.SPRMOD where the part has it. RM0383 3.6.5 gives the F411 PCROP
/// and its header does not declare the bit, so the position is stated here
/// rather than probed: bit 31 in every manual that has it.
constexpr uint32_t flash_pcrop_mode_mask() {
    return flash_facts().has_pcrop_mode ? (1UL << 31) : 0u;
}

/// OPTCR.DB1M and OPTCR.BFB2, by the same rule (bits 30 and 4).
constexpr uint32_t flash_dual_bank_option_mask() {
    return flash_facts().has_dual_bank_option ? (1UL << 30) : 0u;
}
constexpr uint32_t flash_dual_bank_boot_mask() {
    return flash_facts().has_dual_bank_boot ? (1UL << 4) : 0u;
}

/// The system memory, the OTP area and the option bytes: the same
/// addresses in all four chapters (RM0090 tables 5 and 6, RM0390 table 4,
/// RM0383 table 4). The second option-byte block is bank 2's.
inline constexpr uint32_t flash_system_memory_base = 0x1FFF0000UL;
inline constexpr uint32_t flash_system_memory_bytes = 30u * 1024u;
inline constexpr uint32_t flash_otp_base = 0x1FFF7800UL;
inline constexpr uint32_t flash_otp_bytes = 512;
inline constexpr uint32_t flash_otp_lock_base = 0x1FFF7A00UL;
inline constexpr uint32_t flash_otp_blocks = 16;
inline constexpr uint32_t flash_option_bytes_base = 0x1FFFC000UL;
inline constexpr uint32_t flash_option_bytes_base_bank2 = 0x1FFEC000UL;

/// The flash interface's NVIC line - position 4 on every part of this
/// family, and its alone. Guarded like every vector verb here by a
/// base-address macro, this block's own.
constexpr IRQn_Type flash_irq() {
#if defined(FLASH_R_BASE)
    return FLASH_IRQn;
#else
    return NonMaskableInt_IRQn;
#endif
}

// ---- CRC, RNG and bxCAN ---------------------------------------------------------
//
// Three small blocks, three different KINDS of per-part fact. The CRC
// calculation unit is on every part of the family under one name and one
// gate, so it has nothing here at all - stm32f4/crc.hpp names
// RCC_AHB1ENR_CRCEN itself. The other two are optional blocks, and each
// asks the header a different question.

/// Does this part carry the random number generator? The F401, F411 and
/// F446 do not, and their header says so by declaring no RNG_BASE.
constexpr bool rng_present() {
#if defined(RNG_BASE)
    return true;
#else
    return false;
#endif
}

/// WHICH BUS CARRIES THE RNG'S CLOCK GATE. AHB2 on every part that has
/// both the generator and that bus, where RNGEN is bit 6; AHB1 on the
/// F410, which has no AHB2 at all and puts RNGEN at the TOP of
/// RCC_AHB1ENR, bit 31. Neither the register nor the bit is the same, so
/// stm32f4/rng.hpp selects the store with the header's own symbol and this
/// fact is here for the fixture and the document to state.
constexpr bool rng_clock_on_ahb1() {
#if defined(RCC_AHB1ENR_RNGEN)
    return true;
#else
    return false;
#endif
}

/// The RNG's clock-enable bit, whichever register holds it; 0 where the
/// part has no generator.
constexpr uint32_t rng_clock_mask() {
#if defined(RCC_AHB1ENR_RNGEN)
    return RCC_AHB1ENR_RNGEN;
#elif defined(RCC_AHB2ENR_RNGEN)
    return RCC_AHB2ENR_RNGEN;
#else
    return 0u;
#endif
}

/// Its reset line, in the reset register of the same bus.
constexpr uint32_t rng_reset_mask() {
#if defined(RCC_AHB1RSTR_RNGRST)
    return RCC_AHB1RSTR_RNGRST;
#elif defined(RCC_AHB2RSTR_RNGRST)
    return RCC_AHB2RSTR_RNGRST;
#else
    return 0u;
#endif
}

