uliano/brio/brio/stm32f4/device_tables.hpp
#if defined(RNG_BASE)
/**
 * THE RNG'S VECTOR WEARS TWO NAMES, and which one a header declares is not
 * a question the preprocessor can put to an enumerator. The large-line
 * parts (the F405 class, the F42x/F43x, the F469/F479) spell it
 * HASH_RNG_IRQn - the slot is shared with the hash processor whether or not
 * the part has one, and on the F405 class the header adds it as a MACRO
 * alias for its own RNG_IRQn; the small parts that have a generator (the
 * F410, the F412, the F413/F423) spell it RNG_IRQn and declare no other
 * name. The two sets are told apart by the BACKUP SRAM, which exactly the
 * large-line parts carry: the correlation is not a law, it is a reading of
 * the twenty-three headers, and `brio check stm32f4` is what keeps it true
 * (a header on the wrong side of it does not compile).
 */
constexpr IRQn_Type rng_irq() {
#if defined(RCC_AHB1ENR_BKPSRAMEN)
    return HASH_RNG_IRQn;
#else
    return RNG_IRQn;
#endif
}
#endif

/// Register block base of bxCAN instance `n` (1..3), 0 where the part has
/// no such instance. CAN1 and CAN2 come as a PAIR (the F405 class and up,
/// less the F401/F410/F411); CAN3 is the F413/F423's alone.
constexpr uint32_t can_base(uint8_t n) {
    switch (n) {
#if defined(CAN1_BASE)
        case 1: return CAN1_BASE;
#endif
#if defined(CAN2_BASE)
        case 2: return CAN2_BASE;
#endif
#if defined(CAN3_BASE)
        case 3: return CAN3_BASE;
#endif
        default: return 0;
    }
}

constexpr bool can_present(uint8_t n) { return can_base(n) != 0u; }

/// Every bxCAN of this family sits on APB1: the enable bit in
/// RCC_APB1ENR, the reset line in RCC_APB1RSTR, and the bit time counted
/// in PCLK1 periods.
constexpr uint32_t can_clock_mask(uint8_t n) {
    switch (n) {
#if defined(RCC_APB1ENR_CAN1EN)
        case 1: return RCC_APB1ENR_CAN1EN;
#endif
#if defined(RCC_APB1ENR_CAN2EN)
        case 2: return RCC_APB1ENR_CAN2EN;
#endif
#if defined(RCC_APB1ENR_CAN3EN)
        case 3: return RCC_APB1ENR_CAN3EN;
#endif
        default: return 0;
    }
}

constexpr uint32_t can_reset_mask(uint8_t n) {
    switch (n) {
#if defined(RCC_APB1RSTR_CAN1RST)
        case 1: return RCC_APB1RSTR_CAN1RST;
#endif
#if defined(RCC_APB1RSTR_CAN2RST)
        case 2: return RCC_APB1RSTR_CAN2RST;
#endif
#if defined(RCC_APB1RSTR_CAN3RST)
        case 3: return RCC_APB1RSTR_CAN3RST;
#endif
        default: return 0;
    }
}

/**
 * WHICH INSTANCE OWNS THE FILTER BANKS `n` FILTERS THROUGH. The filter
 * block is not per instance: CAN1 is the MASTER and its registers
 * (CAN_FMR, CAN_FM1R, CAN_FS1R, CAN_FFA1R, CAN_FA1R and the bank pairs)
 * serve CAN2 as well, split at CAN_FMR.CAN2SB - so a program that filters
 * on CAN2 writes CAN1's registers and needs CAN1's CLOCK on. CAN3, where
 * it exists, is a master of its own with a filter block of its own.
 * 0 where the instance is absent.
 */
constexpr uint8_t can_filter_master(uint8_t n) {
    if (!can_present(n)) {
        return 0;
    }
    return n == 3u ? 3u : 1u;
}

/**
 * HOW MANY FILTER BANKS THAT BLOCK HAS. Twenty-eight for the CAN1/CAN2
 * pair: RM0090 32.7.4 and RM0390 30.7.4 both say so, and the device
 * header's own `sFilterRegister[28]` agrees. ZERO - meaning NOT READ - for
 * CAN3: ST's header gives all three instances the same struct, so its array
 * says nothing about a block this project has no manual for (RM0430, the
 * F413/F423's, is not on the desk), and stm32f4/can.hpp refuses every
 * filter verb there rather than write a bank that may not exist.
 */
constexpr uint8_t can_filter_banks(uint8_t n) {
    if (!can_present(n)) {
        return 0;
    }
    return n == 3u ? 0u : 28u;
}

/// Is the filter block shared - that is, does this part carry CAN2 beside
/// CAN1, so that CAN_FMR.CAN2SB decides where one instance's banks end and
/// the other's begin?
constexpr bool can_dual() { return can_present(2); }

#if defined(CAN1_BASE)
/// The four vectors an instance has (30.8): the three transmit mailboxes
/// share one, each receive FIFO has its own, and the error, wake-up and
/// sleep events share the fourth. None of them is shared with another
/// peripheral on any header of this family.
constexpr IRQn_Type can_tx_irq(uint8_t n) {
    switch (n) {
        case 1: return CAN1_TX_IRQn;
#if defined(CAN2_BASE)
        case 2: return CAN2_TX_IRQn;
#endif
#if defined(CAN3_BASE)
        case 3: return CAN3_TX_IRQn;
#endif
        default: return NonMaskableInt_IRQn;
    }
}

/// The vector receive FIFO `fifo` (0 or 1) of instance `n` raises.
constexpr IRQn_Type can_rx_irq(uint8_t n, uint8_t fifo) {
    switch (n) {
        case 1: return fifo == 0u ? CAN1_RX0_IRQn : CAN1_RX1_IRQn;
#if defined(CAN2_BASE)
        case 2: return fifo == 0u ? CAN2_RX0_IRQn : CAN2_RX1_IRQn;
#endif
#if defined(CAN3_BASE)
        case 3: return fifo == 0u ? CAN3_RX0_IRQn : CAN3_RX1_IRQn;
#endif
        default: return NonMaskableInt_IRQn;
    }
}

/// The status-change and error vector of instance `n`.
constexpr IRQn_Type can_sce_irq(uint8_t n) {
    switch (n) {
        case 1: return CAN1_SCE_IRQn;
#if defined(CAN2_BASE)
        case 2: return CAN2_SCE_IRQn;
#endif
#if defined(CAN3_BASE)
        case 3: return CAN3_SCE_IRQn;
#endif
        default: return NonMaskableInt_IRQn;
    }
}
#endif

/**
 * IS THE TIME-TRIGGERED COMMUNICATION ERRATUM LIVE ON THIS PART CLASS?
 * ES0206 2.13.1 (every revision of the F427/F437/F429/F439), ES0298
 * 2.15.1 (every revision of the F446) and ES0321 2.15.1 (every revision
 * of the F469/F479) say the same thing in the same words: the mode "is
 * not supported", no time stamp is available, and CAN_MCR.TTCM "must be
 * kept cleared" - with no workaround. Keyed on the part class because an
 * erratum is a document and not a register, and TRUE only for the
 * classes whose errata sheet was read: on the others stm32f4/can.hpp
 * lets the bit be written and the document says which sheets were not
 * read.
 */
constexpr bool can_ttcm_erratum() {
#if defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || \
    defined(STM32F439xx) || defined(STM32F446xx) || defined(STM32F469xx) || \
    defined(STM32F479xx)
    return true;
#else
    return false;
#endif
}

// ---- fmpi2c ---------------------------------------------------------------------
//
// The Fast-mode Plus I2C (RM0390 ch. 23) - the block the F410, F412,
// F413/F423 and F446 carry beside the three of the I2C chapter. Its
// instance, gate and vectors are published above, beside the other I2C's;
// what belongs here is what the CHAPTER's own driver asks and the header
// alone cannot answer.
//
// WHAT THE HEADER ANSWERS: whether the block is there (FMPI2C1_BASE), its
// gate (RCC_APB1ENR_FMPI2C1EN), its two vectors, its kernel-clock selector
// (RCC_DCKCFGR2_FMPI2C1SEL) and whether CR1 has a wake-up enable at all.
// WHAT IT DOES NOT: the implementation table's SMBus row and the DMA
// request mapping, both facts of a REFERENCE MANUAL, and only the F446's
// is on this desk.

/// Whether the device header knows a WUPEN bit in this block's CR1 - the
/// STM32G0's identical register file has one at bit 18 and this family's
/// has not. RM0390 table 127 puts a dash against "Wakeup from Stop mode"
/// and 23.7.1 makes bit 18 reserved; the header agrees, on every part of
/// the pack, which is what this probe reports.
constexpr bool fmpi2c_has_wakeup() {
#if defined(FMPI2C_CR1_WUPEN)
    return true;
#else
    return false;
#endif
}

/// Whether a manual on this desk CLAIMS the SMBus/PMBus half for this
/// part's FMPI2C1 (RM0390 table 127's row, for the F446). False means "no
/// manual read", not "absent": the other three part classes that carry the
/// block have their own manuals and this project has not got them. Nothing
/// refuses on it - 23.7.6 makes TIMEOUTR read back zero where the half is
/// missing, so the SILICON answers, and FmpI2c::smbus_probe() asks it.
constexpr bool fmpi2c_smbus_claimed() {
#if defined(STM32F446xx)
    return true;
#else
    return false;
#endif
}

/**
 * The FMPI2C slice of the DMA request mapping (RM0390 table 28): ONE cell
 * per direction, both on DMA1 channel 2 - the receive request on stream 2
 * and the transmit on stream 5. Keyed per part class like every other
 * chapter's slice; only the F446's manual was read, so on the F410, F412
 * and F413/F423 the table is unknown and an engine is refused there rather
 * than run on a guessed stream.
 */
constexpr DmaPlacements fmpi2c_dma_placements(bool transmit) {
    DmaPlacements p{};
#if defined(STM32F446xx)
    p.known = true;
    p.count = 1;
    p.at[0] = transmit ? DmaPlacement{1, 5, 2} : DmaPlacement{1, 2, 2};
#else
    (void)transmit;
#endif
    return p;
}

/// Whether (controller, stream, channel) is the cell this block's request
/// is wired to. False on a part whose table was not read - a refusal, never
/// a guess.
constexpr bool fmpi2c_dma_placement_valid(bool transmit, uint8_t controller, uint8_t stream,
                                          uint8_t channel) {
    const DmaPlacements p = fmpi2c_dma_placements(transmit);
    if (!p.known) {
        return false;
    }
    for (uint8_t i = 0; i < p.count; ++i) {
        if (p.at[i].controller == controller && p.at[i].stream == stream &&
            p.at[i].channel == channel) {
            return true;
        }
    }
    return false;
}

// ---- the external memory controller --------------------------------------------
//
// WHAT THE HEADER ANSWERS, for RM0090 ch. 37 (RM0390 ch. 11):
//  - WHICH BLOCK THE PART CARRIES. There are two, and they are NOT the
//    same peripheral: the FSMC (a static controller: NOR/PSRAM, NAND,
//    PC Card, no SDRAM) and the FMC (the FSMC's register set plus an
//    SDRAM controller in banks 5 and 6, and a handful of fields the
//    FSMC has not - CCLKEN, CPSIZE, CBURSTRW). ST gives each its own
//    struct names and its own base macros, so FMC_Bank1_R_BASE and
//    FSMC_Bank1_R_BASE are the two questions. The IRQn is the one thing
//    the two share: every header aliases the name it lacks to the name
//    it has, so FMC_IRQn resolves on an FSMC part too and cannot be the
//    presence probe.
//  - WHICH BANKS. NOR/PSRAM's four sub-banks and the SDRAM's two come
//    with the block; the NAND and PC Card halves do not. The F427/F429/
//    F437/F439 carry NAND banks 2 and 3 and a PC Card bank 4
//    (FMC_Bank2_3_R_BASE, FMC_Bank4_R_BASE); the F446/F469/F479 carry
//    NAND bank 3 alone under a struct of its own (FMC_Bank3_R_BASE) and
//    no PC Card at all.
//  - THE GATE AND THE RESET LINE: RCC_AHB3ENR.FMCEN and
//    RCC_AHB3RSTR.FMCRST, bit 0 of the one AHB3 register this family
//    populates.
//
// WHAT IT DOES NOT ANSWER: which pads carry the address, data and
// control lines (a datasheet table, AF12 throughout, and which of them a
// BOARD wires is the board's own fact), and the memory windows of
// figure 457 - fixed by the architecture, identical on every part that
// has the block, and stated in stm32f4/fmc.hpp where they are used.

