uliano/brio/brio/stm32f4/device_tables.hpp
/// Whether this part carries the FMC - the controller with an SDRAM half.
constexpr bool fmc_present() {
#if defined(FMC_Bank1_R_BASE)
    return true;
#else
    return false;
#endif
}

/// Whether this part carries the FSMC instead: the same static banks
/// under other register names and NO SDRAM controller. A part with this
/// and not the FMC has no driver in this stratum, and fmc.hpp says so by
/// name rather than reporting "no external memory".
constexpr bool fsmc_present() {
#if defined(FSMC_Bank1_R_BASE)
    return true;
#else
    return false;
#endif
}

/// Register-block bases, 0 where the part has none. Bank 1 is the
/// NOR/PSRAM control and read-timing pair, bank 1E its write-timing
/// twin, bank 5/6 the SDRAM controller.
constexpr uint32_t fmc_bank1_base() {
#if defined(FMC_Bank1_R_BASE)
    return FMC_Bank1_R_BASE;
#else
    return 0u;
#endif
}

constexpr uint32_t fmc_bank1e_base() {
#if defined(FMC_Bank1E_R_BASE)
    return FMC_Bank1E_R_BASE;
#else
    return 0u;
#endif
}

constexpr uint32_t fmc_sdram_base() {
#if defined(FMC_Bank5_6_R_BASE)
    return FMC_Bank5_6_R_BASE;
#else
    return 0u;
#endif
}

/// The NAND half, asked bank by bank. Bank 2 exists on the F42x/F43x
/// alone; bank 3 wherever the block does. The two live in different
/// structs (FMC_Bank2_3_TypeDef against FMC_Bank3_TypeDef), which is
/// why this answers a BASE and not a struct.
constexpr uint32_t fmc_nand_base(uint8_t bank) {
    switch (bank) {
#if defined(FMC_Bank2_3_R_BASE)
        case 2: return FMC_Bank2_3_R_BASE;
        case 3: return FMC_Bank2_3_R_BASE + 0x20u;
#elif defined(FMC_Bank3_R_BASE)
        case 3: return FMC_Bank3_R_BASE;
#endif
        default: return 0;
    }
}

constexpr bool fmc_nand_bank_present(uint8_t bank) { return fmc_nand_base(bank) != 0u; }

constexpr uint8_t fmc_nand_banks() {
    return static_cast<uint8_t>((fmc_nand_bank_present(2) ? 1 : 0) +
                                (fmc_nand_bank_present(3) ? 1 : 0));
}

/// The PC Card half - bank 4, the F42x/F43x's alone.
constexpr uint32_t fmc_pccard_base() {
#if defined(FMC_Bank4_R_BASE)
    return FMC_Bank4_R_BASE;
#else
    return 0u;
#endif
}

constexpr bool fmc_pccard_present() { return fmc_pccard_base() != 0u; }

/// How many banks each half has where the block exists: four NOR/PSRAM
/// sub-banks under one chip select each, two SDRAM banks.
constexpr uint8_t fmc_static_banks() { return fmc_present() ? 4u : 0u; }
constexpr uint8_t fmc_sdram_banks() { return fmc_sdram_base() != 0u ? 2u : 0u; }

/// RCC_AHB3ENR.FMCEN and RCC_AHB3RSTR.FMCRST, both bit 0.
constexpr uint32_t fmc_clock_mask() {
#if defined(RCC_AHB3ENR_FMCEN)
    return RCC_AHB3ENR_FMCEN;
#else
    return 0u;
#endif
}

constexpr uint32_t fmc_reset_mask() {
#if defined(RCC_AHB3RSTR_FMCRST)
    return RCC_AHB3RSTR_FMCRST;
#else
    return 0u;
#endif
}

/// BCRx.WRAPMOD, the one field of the static half that is not on every
/// FMC part: RM0090 37.5.6 has it (and says it does nothing, because no
/// master of this family emits a wrapping burst), RM0390 11.6.6 leaves
/// bit 10 reserved and the F446/F469/F479 headers declare no mask for
/// it. Zero where the field does not exist.
constexpr uint32_t fmc_wrapped_burst_mask() {
#if defined(FMC_BCR1_WRAPMOD)
    return FMC_BCR1_WRAPMOD;
#else
    return 0u;
#endif
}

/// The one vector the whole controller shares (the NAND banks' FIFO
/// interrupts and the SDRAM's refresh error). Guarded by the block's own
/// base macro, because every header aliases the OTHER block's IRQn name
/// to this one and the enumerator alone proves nothing.
constexpr IRQn_Type fmc_irq() {
#if defined(FMC_Bank1_R_BASE)
    return FMC_IRQn;
#else
    return NonMaskableInt_IRQn;
#endif
}

// ---- the display controller and the accelerator ---------------------------------
//
// WHAT THE HEADER ANSWERS, for RM0090 ch. 16 (the LTDC) and ch. 11 (the
// DMA2D):
//  - WHICH OF THE TWO A PART CARRIES, and they are not the same set.
//    The LTDC is on the parts with a display interface (LTDC_BASE); the
//    DMA2D is on those AND on the two of the same class without a
//    display (DMA2D_BASE), because an accelerator that fills and
//    converts memory is useful with no panel at all. A part may
//    therefore have the accelerator and no controller, and the two
//    questions are asked separately.
//  - WHETHER THE PART HAS THE SECOND PLL, and what that PLL's outputs
//    are. PLLSAI is the LTDC's clock root, and its R output exists only
//    where a display does: the parts with a display declare
//    PLLSAICFGR.PLLSAIR and DCKCFGR.PLLSAIDIVR, the one without declares
//    neither and keeps the P and Q outputs for the audio interface. So
//    "has a second PLL" and "that PLL can make a pixel clock" are two
//    facts, not one.
// Nothing else here is per part: the two layers, the eight pixel
// formats, the register offsets and the blending are the same wherever
// the block is, and are stated in stm32f4/ltdc.hpp and
// stm32f4/dma2d.hpp where they are used.

/// Whether this part carries the LCD-TFT display controller.
constexpr bool ltdc_present() {
#if defined(LTDC_BASE)
    return true;
#else
    return false;
#endif
}

constexpr uint32_t ltdc_base() {
#if defined(LTDC_BASE)
    return LTDC_BASE;
#else
    return 0u;
#endif
}

/// The base of one layer's register block. The two are 0x80 apart and
/// the first sits 0x84 into the peripheral (16.7.14), which is why the
/// device header declares them as two separate bases rather than as an
/// array inside LTDC_TypeDef.
constexpr uint32_t ltdc_layer_base(uint8_t layer) {
#if defined(LTDC_Layer1_BASE)
    switch (layer) {
        case 1: return LTDC_Layer1_BASE;
        case 2: return LTDC_Layer2_BASE;
        default: return 0u;
    }
#else
    (void)layer;
    return 0u;
#endif
}

/// Two layers wherever the controller exists (16.4.2); zero elsewhere.
constexpr uint8_t ltdc_layers() { return ltdc_present() ? 2u : 0u; }

/// RCC_APB2ENR.LTDCEN and RCC_APB2RSTR.LTDCRST, both bit 26. The reset
/// line puts all three of the block's clock domains back (16.3.2).
constexpr uint32_t ltdc_clock_mask() {
#if defined(RCC_APB2ENR_LTDCEN)
    return RCC_APB2ENR_LTDCEN;
#else
    return 0u;
#endif
}

