uliano/brio/brio/stm32f4/device_tables.hpp
constexpr uint32_t ltdc_reset_mask() {
#if defined(RCC_APB2RSTR_LTDCRST)
    return RCC_APB2RSTR_LTDCRST;
#else
    return 0u;
#endif
}

/// TWO vectors, not one (16.5, figure 85): the line and register-reload
/// events on the global one, the FIFO underrun and the transfer error on
/// the error one.
constexpr IRQn_Type ltdc_irq() {
#if defined(LTDC_BASE)
    return LTDC_IRQn;
#else
    return NonMaskableInt_IRQn;
#endif
}

constexpr IRQn_Type ltdc_error_irq() {
#if defined(LTDC_BASE)
    return LTDC_ER_IRQn;
#else
    return NonMaskableInt_IRQn;
#endif
}

/// Whether this part carries the Chrom-Art accelerator.
constexpr bool dma2d_present() {
#if defined(DMA2D_BASE)
    return true;
#else
    return false;
#endif
}

constexpr uint32_t dma2d_base() {
#if defined(DMA2D_BASE)
    return DMA2D_BASE;
#else
    return 0u;
#endif
}

/// RCC_AHB1ENR.DMA2DEN and RCC_AHB1RSTR.DMA2DRST, both bit 23.
constexpr uint32_t dma2d_clock_mask() {
#if defined(RCC_AHB1ENR_DMA2DEN)
    return RCC_AHB1ENR_DMA2DEN;
#else
    return 0u;
#endif
}

constexpr uint32_t dma2d_reset_mask() {
#if defined(RCC_AHB1RSTR_DMA2DRST)
    return RCC_AHB1RSTR_DMA2DRST;
#else
    return 0u;
#endif
}

constexpr IRQn_Type dma2d_irq() {
#if defined(DMA2D_BASE)
    return DMA2D_IRQn;
#else
    return NonMaskableInt_IRQn;
#endif
}

/// Whether the part has the SECOND PLL beside the audio one (6.3.24).
constexpr bool pllsai_present() {
#if defined(RCC_CR_PLLSAION)
    return true;
#else
    return false;
#endif
}

/// Whether that PLL has the R output a pixel clock comes off, and the
/// LCD_CLK divider behind it (6.3.24, 6.3.25). Both are absent on the
/// part that has the PLL for its audio interface alone.
constexpr bool pllsai_has_r() {
#if defined(RCC_PLLSAICFGR_PLLSAIR_Pos)
    return true;
#else
    return false;
#endif
}

constexpr bool pllsai_has_lcd_divider() {
#if defined(RCC_DCKCFGR_PLLSAIDIVR)
    return true;
#else
    return false;
#endif
}

} // namespace brio
